/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_bzero.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kyoshida <kyoshida@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/05/17 14:47:39 by kyoshida          #+#    #+#             */
/*   Updated: 2023/05/20 13:12:33 by kyoshida         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

void	ft_bzero(void *s, size_t n)
{
	if (n != 0)
		ft_memset(s, '\0', n);
}
// int	main(void)
// {
// 	char buf[] = "ABCDEFGHIJ";

// 	//先頭から2バイト進めた位置に「１」を3バイト書き込む
// 	bzero(buf + 2, 1);

// 	//表示
// 	printf("buf文字列→%s\n", buf);

// 	return (0);
// }